{
    "name": "Grail",
    "entities": [
        {
            "entity": "Christian hero Galahad",
            "type": "Person"
        },
        {
            "entity": "Grail",
            "type": "Object"
        },
        {
            "entity": "Lancelot",
            "type": "Person"
        },
        {
            "entity": "Grail Castle",
            "type": "Location"
        },
        {
            "entity": "Percival",
            "type": "Person"
        },
        {
            "entity": "king",
            "type": "Person"
        },
        {
            "entity": "land",
            "type": "Location"
        },
        {
            "entity": "quest for the Grail",
            "type": "Event"
        },
        {
            "entity": "Celtic motifs",
            "type": "Concept"
        }
    ],
    "attributes": [
        {
            "entity": "Galahad",
            "attribute": "receives the Grail and is transfigured into sanctity"
        },
        {
            "entity": "Lancelot",
            "attribute": "finds the Grail Castle but falls into a trance and does not enter"
        },
        {
            "entity": "Percival",
            "attribute": "returns to the Grail Castle, asks the relevant questions—whose is the cup, why does the lance bleed, and what does it all mean?—and thus heals the king and restores the land, after which he himself is elevated to the Kingship"
        }
    ],
    "sources": [
        "Monaghan, Patricia. The Encyclopedia of Celtic Mythology and Folklore. Checkmark Books, 2008."
    ],
    "image": [
        "https://upload.wikimedia.org/wikipedia/commons/7/7c/Dante_Gabriel_Rossetti_-_The_Damsel_of_the_Sanct_Grael_%281874%29.jpg"
    ],
    "cyphertext": "c25oKWAv8lRAdYflSvIJD4J2MoHgvkap_x1YZDEelt0k_Slb2PCM7pRMOiwzS4osNDTCy9tqciFNE2L7oQx8IQ5jSN-lEyRp6XjI6xSFAaVBwLrPKQjrI_Tr2vd-DXVP8vq4t5DcwRbaSTn3wPwqSSGn2dMXaZ2TEIpD-lZt7ENpEtnNyRY5rsRDwgYlEfVAvToDC5f5UGWrxbVXHbKRxDP1ApAVI8eyi59HzEgJ8W3CLSPEj1VaPoTa46t3DwKScRtQWtmNAY7or0pvZqD3x074v-6Xx1XZJGrA7JYHKWmZ_os7KSSzlYgPNNqQZLkBD9aqpLARnV9Z6QTEgkiLB6mxeUjyu50veNmhIWTjvsbT_IzqvOFhQSLz3Aen6A2_o2P5yoUjnEuFGWE_LrI5Lodr9OAvL5owlsapZwx10hIcSjKKfqLbtBSvKHvB1uU54mCRim0BvHEvdyFp-Nkib1Bb_hj6ciSuONmdPswMPyiVmPicH8UJitVWkcyqol8Iy3yiJmHkXnga8Wlh4NKXvaYpQibtFgrdAJgPdUsA5SsOQiBLaWgvme6z6fXSpp6oxksj_gIViGk3UadcjqQBBhervJ3gZDbDm6rj-8eQzRzfxgJzFUV-ZBwi2kXz8q6PyLmOX7mxPRJFuCoFKMKSFNSNEwtZAahyXNkmNR3BIMKFcnXbjSGZovr7tOz2pP5Jc_Dm5pjfAD6hwnFDHwtyoQ2ahs4JqLzFARATghE=",
    "salt": "Y85pBD4HMD2SycSa2IkwzQ==",
    "text": "The Grail, a symbolic object, is often depicted as the sacred cup used by Jesus during his Last Supper in Jerusalem. Alternatively, it is said to be the platter on which his bread or lamb was served or a cup that caught his blood as he lay dying. According to legend, after his resurrection and crucifixion, Joseph Of Arimathea, who was hosting the Last Supper, brought the Grail to Britain. Thus, a Christian emblem of transubstantiation, which denotes the conversion of bread and wine into the body and blood of Jesus, was blended with a series of Celtic legends and myths, creating a complex yet fascinating narrative that has inspired writers and scholars. The Grail quest originated from a Round Table knight named Percival, who visited a dead kingdom ruled by a wounded king with a groin injury, symbolizing his Fertility, causing him to fish in the land's increasingly empty lakes, leading to him being named the Fisher King. Percival was invited to the king's castle and presented with strange visions, including a floating chalice and a bleeding lance that remained suspended in the air while the court sat in silence. Without ever questioning their meaning, Percival simply observed the marvels before him, his silence profound. The vision faded soon after he arrived, the palace, king and court vanishing with it. And thus began the quest for the Grail, each knight granted an individual pursuit based on character alone. The Grail quest culminates in various possible scenarios depending on the text. The Christian hero Galahad, thinly veiled, achieves sanctity by obtaining the Grail. Lancelot finds the Grail Castle but only enters a trance and does not proceed. Percival, however, returns to the Grail Castle, asks the pertinent questions pertaining to the cup, the bleeding lance, and their meaning; he takes the ensuing answers to heal the king and restore the land, ultimately rising to the throne himself. The Grail quest narrative incorporates many Celtic elements; the Fisher King referencing the Blemished King from Celtic lore, where kings with physical imperfections were deemed unfit to rule. The Grail, respectively, embodies the Cauldron from Celtic mythology, utilized by the Welsh goddess Ceridwen to brew Wisdom, and associated with the Welsh hero, Efnisien, as well as the Irish god Dagda's ever-abundant cauldron. The Grail symbolises fertility and is linked with sexuality, sterility occasionally alluded to in certain Christian versions."
}