{
    "name": "Imbolc",
    "entities": [
        {
            "entity": "Isle of Man",
            "type": "Celtic land"
        },
        {
            "entity": "Imbolc",
            "type": "Celtic festival"
        },
        {
            "entity": "May 1",
            "type": "date"
        },
        {
            "entity": "Beltane",
            "type": "Celtic festival"
        },
        {
            "entity": "snow",
            "type": "weather condition"
        },
        {
            "entity": "sunbeam",
            "type": "natural phenomenon"
        },
        {
            "entity": "winter",
            "type": "season"
        },
        {
            "entity": "spring",
            "type": "season"
        },
        {
            "entity": "Cailleach",
            "type": "Celtic deity"
        },
        {
            "entity": "Hag",
            "type": "Celtic deity"
        }
    ],
    "attributes": [
        {
            "entity": "Imbolc",
            "attribute": "sunny"
        },
        {
            "entity": "Imbolc",
            "attribute": "rainy or snowy"
        },
        {
            "entity": "Cailleach",
            "attribute": "weather-controlling"
        },
        {
            "entity": "Cailleach",
            "attribute": "gathering more wood for her fire"
        }
    ],
    "sources": [
        "Monaghan, Patricia. The Encyclopedia of Celtic Mythology and Folklore. Checkmark Books, 2008."
    ],
    "image": [
        "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Saint_Brigid%27s_cross.jpg/1200px-Saint_Brigid%27s_cross.jpg"
    ],
    "cyphertext": "pdn2-GGUKNEOEu9o8IbCjLYOlZ0jQB7wKcxcC6yByFyJXyiq0diI9WVaDVt9WzFx1t7t1wC1ckv-AoWTX--orYSchB1aNEqgRSw-3y81vEKxQImcDalmkwhRjbpDYgW6WmFjIqjWEcWuDd8yCwao9G2BzoPOGbO2AtZy0xo8rAL4NpstRErARz8jZWk2BQK3b0Wkm0fgUxUyoi0BUNhVTpCGYX_Qcyt0W_po6AY3-ZWvyODUfHBwu-rBQlCwZ7eeoWVlqAMlFQkfvzBdnfknVf3Gi8BIfAyFCVwGex_Nmi2e_v2tMNO-LxUEHtZJby9GPVJoFpbHsfqTtWvE_A1Rprok_gDoE6i0MVkaNFdlfTJTyWih2bEPFFCsz3CBYfOEektF2JZ55UnV_ZecQ8SrkLsp8ABzp8VtrNjX02owecFp7EGrBlXapcV0mRqRQpL7-2veUycIxFr2aRMeYMpcvNW5msDdAwIFbvD5G1lljpDT5PfB1U0mHKlag3ITnB8ws7MzlkjY5Pg8T_AQL9yLvDkbX4xa0z0AT5lG-7q32q3vJcRFGb3yyk47A4eAwTThE_nMSZFYjJ_G50s5ahfdiZbrqApTyGDzNEy7mhiIy56LwnS20sGgv6PEPrv5U4HF2v1xryktvGk_szQEsA3zwug_K2P0U-K-_poLbQZNS3ssjI0Hr4hPxEMSMimdglUJyxPKdD-yuc6C5d2QPjPBoBR8xtjrV-s7b_oWx1426RwzSclokrWs",
    "salt": "odBaT4f7_kh-uKNyyDEGbw==",
    "text": "Imbolc or Candlemas, known also as Óilmelc, Oímelg, and Olmec, is a Celtic holiday marking the end of winter and the beginning of spring. The Celts divided their year into four parts and celebrated the time between the solstices and the equinoxes as major festivals. Imbolc, which occurred on February 1, celebrated spring's arrival and was named such possibly because cattle and sheep were pregnant with young at the time, hence \"in the belly.\" Alternatively, some sources suggest that the word means \"to wash\" in reference to a ritual purification carried out at that time. The name Óilmelc, on the other hand, referred to the lactation of ewes that also typically happened in early February. Despite being called spring's awakening, the weather during Imbolc was often still wintry. For this reason, the day was frequently associated with Weather Magic and Divination. The Manx claimed that the \"Old Woman of the Spells,\" a form of the Cailleach, searched for dry sticks on Imbolc, delaying spring and prolonging winter. This tradition is thought to have formed the basis of the American Groundhog Day. In Ireland, the day was dedicated to St. Brigit, a Christianized version of the Celtic goddess of the same name. Her feast day became known as Imbolc, and both Irish and other folk traditions celebrate her. One of these traditions included the creation of reed and rush swastika-like crosses to invite Brigit into the home. On the Isle of Man, the day is known as Laa’l Breeshey, and Manx customs included leaving the front door open to welcome Brigit or the Fairies into the house. Another tradition involved sweeping out the barn and leaving a lit candle beside a table where ale and bread (the \"Brigit supper\") were offered to visiting spirits, including both saintly and fey. Weather divination was commonly practiced on Imbolc in the Isle of Man, much like in other Celtic regions. Legend has it that, just as a bright Imbolc was seen as a good omen, promising an extended winter, the length of the sunbeam on this day predicted the amount of snowfall that would precede May 1st's Beltane. If the rays stretched far, then the winter would last long. If Imbolc was sunny, it was believed that a wet and snowy spring was on the way. A rainy or snowy Imbolc would force the Cailleach, a weather-controlling hag, to stay indoors as she couldn't gather much wood to keep her fire burning; lacking an additional stock of fuel, winter would end early. While seasonal symbolism took precedence over weather divination in Britain, the Cotswold hill country lit candles in every corner of the house to celebrate Imbolc as a tribute to the increasing strength of the sun. It was traditional to serve tea without any artificial light given the strong illumination of the sun on this day. In Scotland, a poppet made of rush or reed and cloth, and adorned with a shell called “the guiding star” on its chest, was constructed and moved from one house to another, often by young women, or put to bed with lullabies. The next morning, the doorstep would be checked for ashes, which were thought to symbolize Brigit's visitation and bring good fortune for the year. See <TOPIC> In ancient times, on the festival of Imbolc, a piece of peat was placed inside a sock and hit against a step while a verse was recited in order to ward off serpents. Different regions in Ireland had their own traditions for Imbolc. Though rural work stopped on this day, farmers might plow a ceremonial furrow in the spring fields or put a spade into the earth as a ritual invocation for good harvest. Outdoors, strips of cloth or ribbons known as Brat Bríde or Brigit’s cloak were placed, to catch the first light of the sun on Imbolc or the dew of the dawn. These cloths were used for healing throughout the year. Holy Wells dedicated to Brigit were (and still are) visited by the faithful. In Kildare, a rush swastika cross was plaited and hung over the door for protection against fire until the next Imbolc when it would be replaced with a new, green one. In western Connemara, a straw rope plaited from rye straw was formed into a circle (the crios bridghe or Brigit cross) and carried from door to door. People would jump through it while praying for health and good fortune. In southwestern Co. Kerry, mummers dressed in white would imitate Brigit and beg from door to door. In recent years, the latter customs have been revived, most significantly in Kildare, a town traditionally associated with Brigit, who has since been transmogrified into the Christian saint. The celebration of Imbolc has become an important local festival in Kildare."
}