{
    "name": "Niamh",
    "entities": [
        {
            "entity": "Oisín",
            "type": "person"
        },
        {
            "entity": "St. Patrick",
            "type": "person"
        },
        {
            "entity": "Fianna",
            "type": "group"
        },
        {
            "entity": "Niamh",
            "type": "person"
        },
        {
            "entity": "Cúchulainn",
            "type": "person"
        },
        {
            "entity": "Concobar Mac Nessa",
            "type": "person"
        }
    ],
    "attributes": [
        {
            "entity": "Oisín",
            "attribute": "Fianna poet"
        },
        {
            "entity": "Oisín",
            "attribute": "beloved Niamh"
        },
        {
            "entity": "Niamh",
            "attribute": "mistress of Cúchulainn"
        },
        {
            "entity": "Niamh",
            "attribute": "married to son of king Concobar Mac Nessa"
        },
        {
            "entity": "Cúchulainn",
            "attribute": "great ULSTER hero"
        },
        {
            "entity": "Concobar Mac Nessa",
            "attribute": "king"
        }
    ],
    "sources": [
        "Monaghan, Patricia. The Encyclopedia of Celtic Mythology and Folklore. Checkmark Books, 2008."
    ],
    "cyphertext": "lwk4wI0kmGPezoxeQHwyL9n713zx3wweu71uj005BuIEv9mgSb9F9G5-nhnxQDaOEB_savP46huo1BUGan6s6FM5DZ48RNIBKYP0ktoWSVkp_LJkI94jn8WXntkHzY6bJUOzMkoDUT-UbZXTkz0rz3FM-8k9Ar1dTnhWpb4qA3SBLjl_V9OdS3cZyXY6g_GYOo-hDGW8CDJuKZ16uKCs-Jyq8pTjAvOOb_neGtbZI6hJN9lPx3pZDL4cI6UTZM75jdlGOu8VEcMGJAFzVsjmEg1N2SU5qyUDPg-d0zmVje04fK6VvIK-sjkC8s0Y_OOlZ0aRNgyrZ36KbA3DH1OhQ8NNoognZLKuUMwicNblJM571oiDWMcwCFo2C-0wxaRH_kJSkQS_iZrex8UicGMcK4-OrnEwWVuTtl6c8v98SVxqAkipCZvdCKEebRyq3eH4lEQTnEuy_TLyOumEYItRADA-gf7m25Ce4sBlyAkhGrtD_1DcoR0mwGujZS6uf91f9x38zqAwib2Hu32Ubk-kI-sTu9mQkK-4F95KmLxi00-bJcp4-F5y9hnkZpC-AE4m0fECXL7xTqM38Gvoztcfc0S5GdozUdQKnuiAaTXbVbcCDp5ZIe3J4B86UFzuwP27D5dyKn_hDoTrzofuHdf-GWMBAnsz7PBxzzj31ZWRk58jhQ==",
    "salt": "a8llsobhRrw_OnOy--d96g==",
    "text": "Irish mythology holds Niamh as a strikingly beautiful fairy queen who was also known as Neeve, Niamh of the Golden Hair, Niave, Niam, and Niau. As the daughter of Manannán Mac Lir, the god of the sea, she lived on an enchanted isle named “land of promise,” also known as Tir Tairngiri. Niamh was incredibly charming, and no human man could resist her allure, which earned her a name that means “beauty.” Men who could not resist her ended up being captivated by her and taken to her world far out in the sea. Among the men who fell for her and were susceptible to her charms was Oisín, the bard of a group of heroes referred to as the Fianna. Oisín left his companions to follow Niamh to her world. The couple experienced overwhelming joy, which was made even more profound after the birth of their daughter, Plur Na Mban, meaning “flower of womanhood.” Oisín eventually became homesick and could not resist going back to Ireland. Niamh, who was still in love with Oisín, was hesitant to release him from her hold knowing the dangers in Ireland's world. Upon his insistence, she yielded to his wishes and asked him not to let his foot touch the ground. After putting him on a fairy horse, Oisín returned to an Ireland that had fundamentally transformed. Time went by more slowly in Niamh's world of Tír na nÓg, and Oisín's return marked the loss of major characters from his past. Consequently, the poet was heartbroken by what he saw, causing him to fall from his horse in disbelief. He succumbed to advanced old age and swiftly passed away. A famous poem draws on the conceit that, before his death, Oisín was able to converse with St. Patrick. Despite the Fianna poet's great eloquence about the ancient pagan ways, the saint was able to convert and baptize him. Regardless, Oisín never saw his beloved Niamh again. There are two less significant characters that also go by the name Niamh. One of them is the mistress of the great ULStER hero Cúchulainn; the other married the son of king Concobar Mac Nessa, whom Cúchulainn served."
}